In [1]:
# Data Analysis Practise

In [3]:
# libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
from pydataset import data

In [8]:
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [9]:
df1 = data('mtcars')
df2 = data('iris')
df3 = data('Airline')

In [10]:
print(df1.head())
print(df2.head())
print(df3.head())

                    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
Mazda RX4          21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
Mazda RX4 Wag      21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
Datsun 710         22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
Hornet 4 Drive     21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa
4           4.6          3.1           1.5          0.2  setosa
5           5.0          3.6           1.4          0.2  setosa
   airline  year     cost    output      pf        lf
1        1     1  1140640  0.952757  106650  0.534487
2        1     2  1215690  0.986757  110307  0.532328
3        1     3  1309570  1.091980  110574  0.547736
4        1     4  1511530  1.175780  121974  0.540846
5        1     5  1676730  1.160170  196606  0.591167

In [13]:
#mtcars Categorical
cols1 = ['cyl','vs', 'am', 'gear', 'carb']
df1[cols1] = df1[cols1].astype('category')
df1.dtypes

mpg      float64
cyl     category
disp     float64
hp         int64
drat     float64
wt       float64
qsec     float64
vs      category
am      category
gear    category
carb    category
dtype: object

In [14]:
df1.describe()

             mpg        disp          hp       drat         wt       qsec
count  32.000000   32.000000   32.000000  32.000000  32.000000  32.000000
mean   20.090625  230.721875  146.687500   3.596563   3.217250  17.848750
std     6.026948  123.938694   68.562868   0.534679   0.978457   1.786943
min    10.400000   71.100000   52.000000   2.760000   1.513000  14.500000
25%    15.425000  120.825000   96.500000   3.080000   2.581250  16.892500
50%    19.200000  196.300000  123.000000   3.695000   3.325000  17.710000
75%    22.800000  326.000000  180.000000   3.920000   3.610000  18.900000
max    33.900000  472.000000  335.000000   4.930000   5.424000  22.900000

In [20]:
mpglabels = ["{0} - {1}".format(i, i + 5) for i in range(10, 34, 5)]
mpglabels

['10 - 15', '15 - 20', '20 - 25', '25 - 30', '30 - 35']

In [23]:
mpgCut = pd.cut(df1.mpg.values, range(10, 40, 5), right=False, labels=mpglabels)

In [24]:
df1[["wt", "hp"]].groupby(mpgCut).agg(["mean", "median"])

               wt                  hp
             mean  median        mean median
10 - 15  4.685800  5.2500  228.000000  230.0
15 - 20  3.513077  3.4600  178.076923  175.0
20 - 25  2.826875  2.8275   98.250000  103.0
25 - 30  2.037500  2.0375   78.500000   78.5
30 - 35  1.790750  1.7250   74.000000   65.5

In [40]:
df1.groupby(['gear', 'am']).aggregate({'mpg':'mean'})

               mpg
gear am
3    0   16.106667
     1         NaN
4    0   21.050000
     1   26.275000
5    0         NaN
     1   21.380000

In [41]:
df1.groupby(['gear', 'am']).aggregate({'mpg':'mean', 'hp':['min','max']})

               mpg    hp
              mean   min    max
gear am
3    0   16.106667  97.0  245.0
     1         NaN   NaN    NaN
4    0   21.050000  62.0  123.0
     1   26.275000  52.0  110.0
5    0         NaN   NaN    NaN
     1   21.380000  91.0  335.0

In [45]:
df1C= df1.groupby(['gear', 'am']).aggregate({'mpg':'mean', 'hp':['min','max'],'carb':'count'}).reindex()
#cannot put as_index=False in groupby
df1C

               mpg    hp         carb
              mean   min    max count
gear am
3    0   16.106667  97.0  245.0    15
     1         NaN   NaN    NaN     0
4    0   21.050000  62.0  123.0     4
     1   26.275000  52.0  110.0     8
5    0         NaN   NaN    NaN     0
     1   21.380000  91.0  335.0     5

In [74]:
NC1C = df1C.columns.map('_'.join)
print(NC1C)

Index(['mpg_mean', 'hp_min', 'hp_max', 'carb_count'], dtype='object')

In [54]:
df1C.reset_index()

  gear am        mpg    hp         carb
                mean   min    max count
0    3  0  16.106667  97.0  245.0    15
1    3  1        NaN   NaN    NaN     0
2    4  0  21.050000  62.0  123.0     4
3    4  1  26.275000  52.0  110.0     8
4    5  0        NaN   NaN    NaN     0
5    5  1  21.380000  91.0  335.0     5

In [66]:
df1D = df1C.reset_index()
df1D.columns[2:]

MultiIndex([( 'mpg',  'mean'),
            (  'hp',   'min'),
            (  'hp',   'max'),
            ('carb', 'count')],
           )

In [67]:
df1D.columns=df1D.columns.droplevel(1)

In [68]:
df1D

  gear am        mpg    hp     hp  carb
0    3  0  16.106667  97.0  245.0    15
1    3  1        NaN   NaN    NaN     0
2    4  0  21.050000  62.0  123.0     4
3    4  1  26.275000  52.0  110.0     8
4    5  0        NaN   NaN    NaN     0
5    5  1  21.380000  91.0  335.0     5

In [75]:
df1D.columns.values[2:] = NC1C
df1D.columns

Index(['gear', 'am', 'mpg_mean', 'hp_min', 'hp_max', 'carb_count'], dtype='object')

In [76]:
df1D.head()

  gear am   mpg_mean  hp_min  hp_max  carb_count
0    3  0  16.106667    97.0   245.0          15
1    3  1        NaN     NaN     NaN           0
2    4  0  21.050000    62.0   123.0           4
3    4  1  26.275000    52.0   110.0           8
4    5  0        NaN     NaN     NaN           0

In [57]:
#Group By One Index Column
df1.groupby('gear')['mpg'].max()

gear
3    21.5
4    33.9
5    30.4
Name: mpg, dtype: float64

In [58]:
#Group By Multiple Index Columns
df1.groupby(['gear', 'am'])['mpg'].max()

gear  am
3     0     21.5
      1      NaN
4     0     24.4
      1     33.9
5     0      NaN
      1     30.4
Name: mpg, dtype: float64

In [59]:
#Group By Index Column and Regular Column
df1.groupby(['gear', 'carb'])['mpg'].nunique()

gear  carb
3     1       3
      2       4
      3       3
      4       4
      6       0
      8       0
4     1       4
      2       4
      3       0
      4       3
      6       0
      8       0
5     1       0
      2       2
      3       0
      4       1
      6       1
      8       1
Name: mpg, dtype: int64